#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_prod.module.onestopauth.module.client_testapp-20211012-1.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=17c09713-1067-439c-8d76-eda0a92b4cbb]
module.keycloak_prod.module.onestopauth.module.client_testapp-20211012-1.keycloak_generic_client_protocol_mapper.display_name_mapper: Refreshing state... [id=7d53b896-ef56-441d-9790-ddc84665c034]
module.keycloak_prod.module.onestopauth.module.client_testapp-20211012-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=4d93bee8-51bc-4628-9bd6-28c86223b758]
module.keycloak_prod.module.onestopauth.module.client_testapp-20211012-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=433c6050-f9af-4d52-9d8d-d4cc22370459]
module.keycloak_prod.module.onestopauth.module.client_testapp-20211012-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=6be1ff59-fbb1-413c-8ba7-0dc82d0a8f09]
module.keycloak_prod.module.onestopauth.module.client_testapp-20211012-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=0a5b7488-e47c-40cc-9270-3a7cb6c98740]
module.keycloak_prod.module.onestopauth.module.client_testapp-20211012-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=532e882f-23e3-4b1f-b623-87da219e84a5]
module.keycloak_prod.module.onestopauth.module.client_testapp-20211012-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=a71a96c9-512b-4ffe-998b-4118884e2afd]
module.keycloak_prod.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b8bd22c9-0a5f-47f1-89da-4430b016d0ea]
module.keycloak_prod.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=ba334adb-6fa7-4bfc-9918-3a9a54c73c69]
module.keycloak_prod.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=170359c9-2d56-494b-939d-380b2f4a3453]
module.keycloak_prod.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b3ae65d6-7212-49b9-a40a-77d448343289]
module.keycloak_prod.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=5ebb727d-8fca-4e8b-8075-ec64828e6255]
module.keycloak_prod.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=d133566a-2560-4046-971b-43be882b8b97]
module.keycloak_prod.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=0477efdc-18ca-4b68-b0f0-37050645d255]
module.keycloak_prod.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.display_name_mapper: Refreshing state... [id=ab795bca-423e-4753-8179-0c3709402855]
module.keycloak_prod.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=361bb68d-6eb7-4669-86ed-4c945bda5677]
module.keycloak_prod.module.onestopauth.module.client_jon-test-2-298.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=15dc84b9-850c-456e-92d4-f306f0e11268]
module.keycloak_prod.module.onestopauth.module.client_jon-test-2-298.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c3a7fd5e-2c29-41a1-89bc-d52a09de4c20]
module.keycloak_prod.module.onestopauth.module.client_jon-test-2-298.keycloak_generic_client_protocol_mapper.display_name_mapper: Refreshing state... [id=33c9c597-013a-4ed3-b255-eb6b72514cb0]
module.keycloak_prod.module.onestopauth.module.client_jon-test-2-298.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=eff1f947-fc80-42ff-962e-7a4f1bf68e7a]
module.keycloak_prod.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2aba48ea-ad83-437f-9a32-115347ffc4fa]
module.keycloak_prod.module.onestopauth.module.client_jon-test-2-298.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=75933e91-65b5-4d32-98da-99bdd12046bb]
module.keycloak_prod.module.onestopauth.module.client_jon-test-2-298.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=949c4a17-105e-4c9b-ae5a-ed0b82fc294f]
module.keycloak_prod.module.onestopauth.module.client_jon-test-2-298.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=5f12246e-2c96-45e7-ace5-b0a9958f2346]
module.keycloak_prod.module.onestopauth.module.client_jon-test-2-298.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=06cf956e-4dba-4925-bfea-e4edecf6e7b8]
module.keycloak_prod.module.onestopauth.module.client_jon-test-2-298.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=5eaeacca-f28b-4812-adc5-c888c49df10e]
module.keycloak_prod.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=56b2eb06-b297-475c-948c-225ddad4d3e8]
module.keycloak_prod.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=70f7709f-d718-47dd-afdf-6216c388aab0]
module.keycloak_prod.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=7e753b3d-fbd5-4824-935d-e49c5a910813]
module.keycloak_prod.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=b499e0ab-3c6d-4ccd-8343-87c03fc7449c]
module.keycloak_prod.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=a089bf5d-d565-4d38-80b7-883497c4a7dd]
module.keycloak_prod.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=64ae9987-1ae5-4737-8a4b-93746552a822]
module.keycloak_prod.module.onestopauth.module.client_test-6-340.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=ae386d64-784a-4a8b-ba94-6941129e3ad3]
module.keycloak_prod.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=552ed6bd-c554-4334-84c7-0a48d438c7dd]
module.keycloak_prod.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3e160578-b8f2-4d3a-8532-ca1893c9ac3c]
module.keycloak_prod.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=258e8b95-acb9-4a29-afe2-897b3d5ba068]
module.keycloak_prod.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=73ee4f1d-3217-4e32-87f5-e5dda27ce9b3]
module.keycloak_prod.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.display_name_mapper: Refreshing state... [id=9132f6f9-c39c-4aae-85be-c8a2f7e062f7]
module.keycloak_prod.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=9cc9674a-c23f-4d45-9d86-6d34cb7c767e]
module.keycloak_prod.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.display_name_mapper: Refreshing state... [id=88206654-7757-407f-9bc8-5a06a824a337]
module.keycloak_prod.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=5835e677-1f31-41f4-93a0-1030f961940a]
module.keycloak_prod.module.onestopauth.module.client_test-6-340.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=351edd81-822c-4891-aef9-2a77aaf52f94]
module.keycloak_prod.module.onestopauth.module.client_test-6-340.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=f2e2fff6-9d38-405c-a63b-ce0dda1ff458]
module.keycloak_prod.module.onestopauth.module.client_test-6-340.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=8f6c704d-f04f-491f-a5f1-9aac0a9d9b0b]
module.keycloak_prod.module.onestopauth.module.client_test-6-340.keycloak_generic_client_protocol_mapper.display_name_mapper: Refreshing state... [id=d344d5a7-7a7c-4aee-b79d-7fcbf1300b35]
module.keycloak_prod.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=78543f81-0464-48da-b289-0872a5684198]
module.keycloak_prod.module.onestopauth.module.client_test-6-340.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=a200029a-e80b-49f8-a7fa-6082ad3fe89c]
module.keycloak_prod.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=edd3c802-b50b-4ae1-b13a-09efc1ad38dc]
module.keycloak_prod.module.onestopauth.module.client_test-6-340.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=76a2a376-381b-440b-93c3-68ebcdd0bf71]
module.keycloak_prod.module.onestopauth.module.client_test-6-340.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=c41ccebc-f2d0-414b-950b-c59c802b6a75]
module.keycloak_prod.module.onestopauth.module.client_test-6-340.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=cf417984-89d6-4b04-8657-cf1ceaaa78c6]
module.keycloak_prod.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=fbe6482e-4bcc-4c32-88df-4933245390df]
module.keycloak_prod.module.onestopauth.module.client_feb-28-pm-test-2-idir-sso-admin-edits-5909.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=5d3168e0-35c2-4acf-9229-1fded4bd5b92]
module.keycloak_prod.module.onestopauth.module.client_feb-28-pm-test-2-idir-sso-admin-edits-5909.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=52080724-7d1e-463a-819d-86415972f2b0]
module.keycloak_prod.module.onestopauth.module.client_feb-28-pm-test-2-idir-sso-admin-edits-5909.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=ca58417e-c980-400f-a44d-f6a32f488f45]
module.keycloak_prod.module.onestopauth.module.client_feb-28-pm-test-2-idir-sso-admin-edits-5909.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=24ccdc8b-c302-434e-b6f4-4521fff59f8d]
module.keycloak_prod.module.onestopauth.module.client_feb-28-pm-test-2-idir-sso-admin-edits-5909.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=b4a5bc38-c60b-4e61-8e2e-847b6b5b269a]
module.keycloak_prod.module.onestopauth.module.client_feb-28-pm-test-2-idir-sso-admin-edits-5909.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=3bd6efe3-38ff-4f0f-8c53-99ac6c10b8b5]
module.keycloak_prod.module.onestopauth.module.client_feb-28-pm-test-2-idir-sso-admin-edits-5909.keycloak_generic_client_protocol_mapper.display_name_mapper: Refreshing state... [id=62454ede-1064-4e9c-b9ed-f6ea4104bcdd]
module.keycloak_prod.module.onestopauth.module.client_feb-28-pm-test-2-idir-sso-admin-edits-5909.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=eee4618e-eecd-404c-a226-de04e6326831]
module.keycloak_prod.module.onestopauth.module.client_feb-28-pm-test-2-idir-sso-admin-edits-5909.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=dd0debd3-bb0d-4cfa-b37c-078f86bf2e2e]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5c4cac7f-0510-496d-94c4-3c6ca11818e7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cd58f131-d1c6-42b8-a4aa-6121783968a5]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=aad22f8b-0eac-4152-b0fd-bc50210be416]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e0265be7-394d-45e0-a698-891db72ef1c7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=47c85585-5ec7-4691-970f-f6fe3f91ebd6]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=65845072-a61d-4c8a-bdb3-824835aebac7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.display_name_mapper: Refreshing state... [id=31513666-47dd-4882-bf62-833188217a03]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=300c4fbf-1228-4968-be76-d27a38079105]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e2bed365-e3e7-4541-a4b8-f1dd45835965]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2a9d4f7d-00f2-4a2f-8cb4-d5cc120a8a1b]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f345e9f1-be87-4b71-ae6f-d9e55be698f9]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ab096687-352c-4eb7-8ff1-c49daccf7988]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7735369f-97b6-40d1-b9d7-d11e2d5e8264]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8fbaa254-7423-4ae2-8755-661e88b7030c]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.display_name_mapper: Refreshing state... [id=478093b5-1d85-44ee-9290-1dde831f4bb2]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8c6e98fe-75a4-42a7-bf1b-c3d7e579dd0b]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=44c24238-10b4-4d9a-b971-bfbaf3a57f49]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=afe980db-1143-4496-95e6-6af762624016]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "kuro-mar-07-b-ce-id-both-test-6372"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "kuro-mar-07-b-ce-id-both-test-6372"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.display_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "display_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "display_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "displayName"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "display_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "kuro-mar-07-b-ce-id-both-test-6372"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "kuro-mar-07-b-ce-id-both-test-6372"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-both"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://bceidDev.com",
        ]
      + web_origins                              = [
          + "+",
          + "http://bceidDev.com",
        ]
    }

  # module.keycloak_test.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "kuro-mar-07-b-ce-id-both-test-6372"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "kuro-mar-07-b-ce-id-both-test-6372"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.display_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "display_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "display_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "displayName"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "display_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "kuro-mar-07-b-ce-id-both-test-6372"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "kuro-mar-07-b-ce-id-both-test-6372"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-both"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://bceidTest.com",
        ]
      + web_origins                              = [
          + "+",
          + "http://bceidTest.com",
        ]
    }

Plan: 20 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 4270 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*